l20074765/EV_lpc1768_mdb_bill_coin/Firmware/LPC1700PinCfg.h
/****************************************Copyright (c)*************************************************
**                      Fujian Junpeng Communicaiton Technology Co.,Ltd.
**                               http://www.easivend.com.cn
**--------------File Info--------------------------------------------------------------------------------
** File name:			LPC1700PinCfg.c
** Last modified Date:  2009-05-12
** Last Version:		V1.01
** Descriptions:		引脚配置		
**-------------------------------------------------------------------------------------------------------
** Modified by:			sunway
** Modified date:		2013-01-06
** Version:				V1.2
** Descriptions:		对程序的风格以及注释略作调整，并检查代码
********************************************************************************************************/
#ifndef __LPC1700PINCFG_H
#define __LPC1700PINCFG_H
/*********************************************************************************************************
** P0口引脚功能设置
*********************************************************************************************************/
// P0.0
#define	P0_0_GPIO             0x00                                      /* GPIO                         */
#define P0_0_RD1              0x01                                      /* CAN-1控制器接收引脚          */
#define P0_0_TXD3             0x02                                      /* UART3发送引脚                */
#define P0_0_SDA1             0x03                                      /* I2C-1数据线（开漏）          */
#define P0_0_FNUC             P0_0_TXD3
//P0.1
#define P0_1_GPIO             0x00                                      /* GPIO                         */
#define P0_1_TD1              0x01                                      /* CAN-1控制器发送引脚          */
#define P0_1_RXD3             0x02                                      /* UART3接收引脚                */
#define P0_1_SCL1             0x03                                      /* I2C-1时钟线（开漏）          */
#define P0_1_FNUC             P0_1_RXD3
//P0.2
#define P0_2_GPIO             0x00                                      /* GPIO                         */
#define P0_2_TXD0             0x01                                      /* UART0发送引脚                */
#define P0_2_AD07             0x02                                      /* AD0.7引脚                    */
//...   Reserved              0x03
#define P0_2_FNUC             P0_2_TXD0
//P0.3
#define P0_3_GPIO             0x00                                      /* GPIO                         */
#define P0_3_RXD0             0x01                                      /* UART0接收引脚                */
#define P0_3_AD06             0x02                                      /* AD0.6引脚                    */
//...   Reserved              0x03 
#define P0_3_FNUC             P0_3_RXD0
//P0.4
#define P0_4_GPIO             0x00                                      /* GPIO                         */
#define P0_4_I2SRX_CLK        0x01                                      /* I2S总线接收时钟SCK           */
#define P0_4_RD2              0x02                                      /* CAN-2接收线                  */
#define P0_4_CAP20            0x03                                      /* 定时器2捕获输入，通道0       */		
#define P0_4_FNUC             P0_4_GPIO
//P0.5
#define P0_5_GPIO             0x00                                      /* GPIO                         */
#define P0_5_I2SRX_WS         0x01                                      /* I2S总线接收字选择WS          */
#define P0_5_TD2              0x02                                      /* CAN-2发送线                  */
#define P0_5_CAP21            0x03                                      /* 定时器2捕获输入，通道1       */		
#define P0_5_FNUC             P0_5_GPIO
//P0.6
#define P0_6_GPIO             0x00                                      /* GPIO                         */
#define P0_6_I2SRX_SDA        0x01                                      /* I2S总线接收数据线SD          */
#define P0_6_SSEL1            0x02                                      /* SSP-1总线从机选择            */
#define P0_6_MAT20            0x03                                      /* 定时器2匹配输出，通道0       */		
#define P0_6_FNUC             P0_6_GPIO
//P0.7
#define P0_7_GPIO             0x00                                      /* GPIO                         */
#define P0_7_I2STX_CLK        0x01                                      /* I2S总线发送时钟线SCK         */
#define P0_7_SSCK1            0x02                                      /* SSP-1时钟线                  */
#define P0_7_MAT21            0x03                                      /* 定时器2匹配输出，通道1       */	
#define P0_7_FNUC             P0_7_GPIO
//P0.8
#define P0_8_GPIO             0x00                                      /* GPIO                         */
#define P0_8_I2STX_WS         0x01                                      /* I2S总线发送字选择WS          */
#define P0_8_SMISO1           0x02                                      /* SSP-1主输入从输出数据线      */
#define P0_8_MAT22            0x03                                      /* 定时器2匹配输出，通道2       */
#define P0_8_FNUC             P0_8_GPIO		
//P0.9
#define P0_9_GPIO             0x00                                      /* GPIO                         */
#define P0_9_I2STX_SDA        0x01                                      /* I2S总线发送数据线SD          */
#define P0_9_SMOSI1           0x02                                      /* SSP-1主输出从输入数据线      */
#define P0_9_MAT23            0x03                                      /* 定时器2匹配输出，通道3       */
#define P0_9_FNUC             P0_9_GPIO
//P0.10
#define P0_10_GPIO            0x00                                      /* GPIO                         */
#define P0_10_TXD2            0x01                                      /* UART2发送引脚                */
#define P0_10_SDA2            0x02                                      /* I2C-2数据线(非开漏引脚)      */
#define P0_10_MAT30           0x03                                      /* 定时器3匹配输出，通道0       */
#define P0_10_FNUC            P0_10_TXD2               
//P0.11
#define P0_11_GPIO            0x00                                      /* GPIO                         */
#define P0_11_RXD2            0x01                                      /* UART2接收引脚                */
#define P0_11_SCL2            0x02                                      /* I2C-2时钟线(非开漏引脚)      */
#define P0_11_MAT31           0x03                                      /* 定时器3匹配输出，通道1       */
#define P0_11_FNUC            P0_11_RXD2                
//P0.15
#define P0_15_GPIO            0x00                                      /* GPIO                         */
#define P0_15_TXD1            0x01                                      /* UART1发送引脚                */
#define P0_15_SCK0            0x02                                      /* SSP0时钟线                   */
#define P0_15_SCK             0x03                                      /* SPI时钟线                    */                                             
#define P0_15_FNUC            P0_15_GPIO                                                                
//P0.16
#define P0_16_GPIO            0x00                                      /* GPIO                         */
#define P0_16_RXD1            0x01                                      /* UART1接收引脚                */
#define P0_16_SSEL0           0x02                                      /* SSP0从机选择                 */
#define P0_16_SSEL            0x03                                      /* SPI从机选择                  */                                               
#define P0_16_FNUC            P0_16_GPIO                                                         
//P0.17
#define P0_17_GPIO            0x00                                      /* GPIO                         */
#define P0_17_CTS1            0x01                                      /* UART1清零发送信号CTS         */
#define P0_17_MISO0           0x02                                      /* SSP0主输入从输出数据线       */
#define P0_17_MISO            0x03                                      /* SPI主入从出数据线            */                                               
#define P0_17_FNUC            P0_17_GPIO                                                         
//P0.18
#define P0_18_GPIO            0x00                                      /* GPIO                         */
#define P0_18_DCD1            0x01                                      /* UART1数据载波检测输入DCD     */
#define P0_18_MOSI0           0x02                                      /* SSP-0主输出从输入数据线      */
#define P0_18_MOSI            0x03                                      /* SPI主出从入数据线            */                                              
#define P0_18_FNUC            P0_18_GPIO                                                          
//P0.19
#define P0_19_GPIO            0x00                                      /* GPIO                         */
#define P0_19_DSR1            0x01                                      /* UART1数据设置就绪DSR         */
//...   Reserved              0x02                                      /* 保留                         */
#define P0_19_SDA1            0x03                                      /* I2C-1数据线（非开漏）        */                                              
#define P0_19_FNUC            P0_19_GPIO                                                          
//P0.20
#define P0_20_GPIO            0x00                                      /* GPIO                         */
#define P0_20_DTR1            0x01                                      /* UART1终端就绪DTR             */
//...   Reserved              0x02                                  	/* 保留                         */
#define P0_20_SCL1            0x03                                      /* I2C-1时钟线（非开漏）        */                                          
#define P0_20_FNUC            P0_19_GPIO                                      
//P0.21
#define P0_21_GPIO            0x00                                      /* GPIO                         */
#define P0_21_RI1             0x01                                      /* UART1振铃信号                */
//...   Reserved              0x02                                      /* 保留                         */
#define P0_21_RD1             0x03                                      /* CAN-1接收引脚                */                                    
#define P0_21_FNUC            P0_21_GPIO                                      
//P0.22
#define P0_22_GPIO            0x00                                      /* GPIO                         */
#define P0_22_RTS1            0x01                                      /* UART1请求发送引脚            */
//...   Reserved              0x02                                      /* 保留                         */
#define P0_22_TD1             0x03                                      /* CAN-1发送线                  */                                   
#define P0_22_FNUC            P0_22_GPIO                                      
//P0.23
#define P0_23_GPIO            0x00                                      /* GPIO                         */
#define P0_23_AD00            0x01                                      /* ADC-0，通道0                 */
#define P0_23_I2SRX_CLK       0x02                                      /* I2S接收时钟SCK               */
#define P0_23_CAP30           0x03                                      /* 定时器3捕获输入，通道0       */                                     
#define P0_23_FNUC            P0_23_GPIO                                       
//P0.24
#define P0_24_GPIO            0x00                                      /* GPIO                         */
#define P0_24_AD01            0x01                                      /* ADC-0，通道1                 */
#define P0_24_I2SRX_WS        0x02                                      /* I2S接收字选择WS              */
#define P0_24_CAP31           0x03                                      /* 定时器3捕获输入，通道1       */                                      
#define P0_24_FNUC            P0_24_GPIO                                       
//P0.25
#define P0_25_GPIO            0x00                                      /* GPIO                         */
#define P0_25_AD02            0x01                                      /* ADC-0，通道2                 */
#define P0_25_I2SRX_SDA       0x02                                      /* I2S接收数据SD                */
#define P0_25_TXD3            0x03                                      /* UART3发送引脚                */                                  
#define P0_25_FNUC            P0_25_GPIO                                               
//P0.26
#define P0_26_GPIO            0x00                                      /* GPIO                         */
#define P0_26_AD03            0x01                                      /* ADC-0，通道3                 */
#define P0_26_AOUT            0x02                                      /* DAC输出                      */
#define P0_26_RXD3            0x03                                      /* UART-3接收引脚               */                                        
#define P0_26_FNUC            P0_26_GPIO                                              
//P0.27
#define P0_27_GPIO            0x00                                      /* GPIO                         */
#define P0_27_SDA0            0x01                                      /* I2C0数据输入/输出，开漏      */
#define P0_27_USB_SDA         0x02                                      /* USB接口I2C串行数据OTG收发器  */
//..    Reserved              0x03                                      /* 保留                         */                                         
#define P0_27_FNUC            P0_27_SDA0                                              
//P0.28
#define P0_28_GPIO            0x00                                      /* GPIO                         */
#define P0_28_SCL0            0x01                                      /* I2C0时钟输入，开漏           */
#define P0_28_USB_SCL         0x02                                      /* USB接口I2C时钟线，OTG收发器  */
//..    Reserved              0x03                                   /* 保留                         */                                     
#define P0_28_FNUC            P0_28_SCL0                                       
// P0.29
#define P0_29_GPIO            0x00                                      /* GPIO                         */
#define P0_29_USB_DD          0x01                                      /* USB双向数据D+线              */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */                                      
#define P0_29_FNUC            P0_29_GPIO                                      
//P0.30
#define P0_30_GPIO            0x00                                      /* GPIO                         */
#define P0_30_USB_DS          0x01                                      /* USB双向数据D-线              */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */                                     							  
#define P0_30_FNUC            P0_30_GPIO 
/*********************************************************************************************************
** P1口引脚功能设置
*********************************************************************************************************/
//P1.0
#define P1_0_GPIO             0x00                                      /* GPIO                         */
#define P1_0_ENET_TXD0        0x01                                      /* 以太网发送数据脚0            */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */
#define P1_0_FNUC             P1_0_GPIO
// P1.1
#define P1_1_GPIO             0x00                                      /* GPIO                         */
#define P1_1_ENET_TX_EN       0x01                                      /* 以太网发送数据脚1            */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */
#define P1_1_FNUC             P1_1_GPIO
// P1.4
#define P1_4_GPIO             0x00                                      /* GPIO                         */
#define P1_4_ENET_TX_EN       0x01                                      /* 以太网发送使能               */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */
#define P1_4_FNUC             P1_4_GPIO
//P1.8
#define P1_8_GPIO             0x00                                      /* GPIO                         */
#define P1_8_ENET_CRS         0x01                                      /* 以太网载波侦测脚             */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */										     
#define P1_8_FNUC             P1_8_GPIO
//P1.9
#define P1_9_GPIO             0x00                                      /* GPIO                         */
#define P1_9_ENET_RXD0        0x01                                      /* 以太网接收数据脚0            */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */													  
#define P1_9_FNUC             P1_9_GPIO
//P1.10
#define P1_10_GPIO            0x00                                      /* GPIO                         */
#define P1_10_ENET_RXD1       0x01                                      /* 以太网接收数据脚1            */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */
#define P1_10_FNUC            P1_10_GPIO
//P1.11
#define P1_14_GPIO            0x00                                      /*  GPIO                        */
#define P1_14_ENET_RX_ER      0x01                                      /* 以太网接收错误               */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */													     
#define P1_14_FNUC            P1_14_GPIO
//P1.15
#define P1_15_GPIO            0x00                                      /* GPIO                         */
#define P1_15_ENET_REF_CLK    0x01                                      /* 以太网参拷时钟输入           */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */											   
#define P1_15_FNUC            P1_15_GPIO
//P1.16
#define P1_16_GPIO            0x00                                      /* GPIO                         */
#define P1_16_ENET_MDC        0x01                                      /* 以太网MIIM时钟               */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */
#define P1_16_FNUC            P1_16_GPIO
//P1.17
#define P1_17_GPIO            0x00                                      /* GPIO                         */
#define P1_17_ENET_MDIO       0x01                                      /* 以太网MI数据输入\输出        */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */
#define P1_17_FNUC            P1_17_GPIO
//P1.18
#define P1_18_GPIO            0x00                                      /*  GPIO                        */
#define P1_18_USB_UP_LED      0x01                                      /* USB GOODLINK指示脚           */
#define P1_18_PWM11           0x02                                      /* PWM1输出，通道1              */
#define P1_18_CAP10           0x03                                      /* Timer1捕获输入，通道0        */                                             
#define P1_18_FNUC            P1_18_GPIO                                                
//P1.19
#define P1_19_GPIO            0x00                                      /*  GPIO                        */
#define P1_19_MCO0A           0x01                                      /* 电机控制PWM通道0，输出A      */
#define P1_19_USB_PPWR        0x02                                      /* USB端口电源使能信号          */
#define P1_19_CAP11           0x03                                      /* Timer1捕获输入，通道1        */                                             
#define P1_19_FNUC            P1_19_GPIO                                                 
//P1.20
#define P1_20_GPIO            0x00                                      /*  GPIO                        */
#define P1_20_MCFB0           0x01                                      /* 电机控制PWM通道0，回环输入   */
#define P1_20_PWM12           0x02                                      /* PWM-2输出，通道2             */
#define P1_20_SCK0            0x03                                      /* SSP-0时钟输入                */                                            
#define P1_20_FNUC            P1_20_GPIO                                                
// P1.21
#define P1_21_GPIO            0x00                                      /* GPIO                         */
#define P1_21_MCABORT         0x01                                      /* 电机控制PWM，紧急中止        */
#define P1_21_PWM13           0x02                                      /* PWM-1输出，通道3             */
#define P1_21_SSEL0           0x03                                      /* SSP-0从机选择                */                                             
#define P1_21_FNUC            P1_21_GPIO                                                
//P1.22
#define P1_22_GPIO            0x00                                      /* GPIO                         */
#define P1_22_MC0B            0x01                                      /* 电机控制PWM通道0，输出B      */
#define P1_22_USB_PWRD        0x02                                      /* USB端口的电源状态            */
#define P1_22_MAT10           0x03                                      /* 定时器1匹配输出，通道0       */                                             
#define P1_22_FNUC            P1_22_GPIO                                                 
//P1.23
#define P1_23_GPIO            0x00                                      /* GPIO                         */
#define P1_23_MCFB1           0x01                                      /* 电机控制PWM通道1，反馈输入   */
#define P1_23_PWM14           0x02                                      /* PWM-1输出，通道4             */
#define P1_23_MISO0           0x03                                      /* SSP-0主机输入，从机输出      */                                              
#define P1_23_FNUC            P1_23_GPIO                                                  
//P1.24
#define P1_24_GPIO            0x00                                      /* GPIO                         */
#define P1_24_MCFB2           0x01                                      /* 电机控制PWM通道2，反馈输入   */
#define P1_24_PWM15           0x02                                      /* PWM-1输出，通道5             */
#define P1_24_MOSI0           0x03                                      /* SSP-0主机输出，从机输入      */                                             
#define P1_24_FNUC            P1_24_GPIO                                               
//P1.25
