l20074765/EV_lpc1768_mdb_bill_coin/Firmware/LPC1700PinCfg.h
#define P1_25_GPIO            0x00                                      /* GPIO                         */
#define P1_25_MC1A            0x01                                      /* 电机控制PWM通道1，输出A      */
#define P1_25_CLKOUT          0x02                                      /* 时钟输出引脚                 */
#define P1_25_MAT11           0x03                                      /* 定时器1匹配输出，通道1       */                                             
#define P1_25_FNUC            P1_25_GPIO                                                 
//P1.26
#define P1_26_GPIO            0x00                                      /* GPIO                         */
#define P1_26_MC1B            0x01                                      /* 电机控制PWM通道1，输出B      */
#define P1_26_PWM16           0x02                                      /* PWM-1输出，通道6             */
#define P1_26_CAP00           0x03                                      /* 定时器0捕获输入，通道0       */                                             
#define P1_26_FNUC            P1_26_GPIO                                             
//P1.27
#define P1_27_GPIO            0x00                                      /* GPIO                         */
#define P1_27_CLKOUT          0x01                                      /* 时钟输出引脚                 */
#define P1_27_USB_OVRCR       0x02                                      /* USB端口过载电流状态          */
#define P1_27_CAP01           0x03                                      /* 定时器0捕获输入，通道1       */                                              
#define P1_27_FNUC            P1_27_GPIO                                                 
// P1.28
#define P1_28_GPIO            0x00                                      /* GPIO                         */
#define P1_28_MC2A            0x01                                      /* 电机控制PWM通道2，输出A      */
#define P1_28_PCAP10          0x02                                      /* PWM-1捕获输入，通道0         */
#define P1_28_MAT00           0x03                                      /* 定时器0匹配输出，通道0       */                                             
#define P1_28_FNUC            P1_28_GPIO                                                 
// P1.29
#define P1_29_GPIO            0x00                                      /* GPIO                         */
#define P1_29_MC2B            0x01                                      /* 电机控制PWM通道2，输出B      */
#define P1_29_PCAP11          0x02                                      /* PWM-1捕获输入，通道1         */
#define P1_29_MAT01           0x03                                      /* 定时器0匹配输出，通道1       */                                             
#define P1_29_FNUC            P1_29_GPIO                                                  
//P1.30
#define P1_30_GPIO            0x00                                      /* GPIO                         */
//...   Reserved              0x01                                      /* 保留                         */
#define P1_30_VBUS            0x02                                      /* 存在的USB总线电源            */
#define P1_30_AD04            0x03                                      /* ADC转换器0.通道4输入         */                                             
#define P1_30_FNUC            P1_30_GPIO                                                 
//P1.31
#define P1_31_GPIO            0x00                                      /* GPIO                         */
//...   Reserved              0x01                                      /* 保留                         */
#define P1_31_SSCK1           0x02                                      /* SSP-1时钟线                  */
#define P1_31_AD05            0x03                                      /* ADC-0输入，通道5             */                                            
#define P1_31_FNUC            P1_31_GPIO                                                
/*********************************************************************************************************
** P2口引脚功能设置
*********************************************************************************************************/
//P2.0
#define P2_0_GPIO             0x00                                      /* GPIO                         */
#define P2_0_PWM11            0x01                                      /* PWM-1，通道1                 */
#define P2_0_TXD1             0x02                                      /* UART1数据发送引脚            */
//...   Reserved              0x03                                      /* 保留                         */
#define P2_0_FNUC             P2_0_GPIO
// P2.1
#define P2_1_GPIO             0x00                                      /* GPIO                         */
#define P2_1_PWM12            0x01                                      /* PWM-1，通道2                 */
#define P2_1_RXD1             0x02                                      /* UART1数据接收引脚            */
//...   Reserved              0x03                                      /* 保留                         */
#define P2_1_FNUC             P2_1_GPIO
// P2.2
#define P2_2_GPIO             0x00                                      /* GPIO                         */
#define P2_2_PWM13            0x01                                      /* PWM-1，通道3                 */
#define P2_2_CTS1             0x02                                      /* UART1清零发送线              */
//...   Reserved              0x03                                      /* 保留                         */
#define P2_2_FNUC             P2_2_GPIO
//P2.3
#define P2_3_GPIO             0x00                                      /* GPIO                         */
#define P2_3_PWM14            0x01                                      /* PWM-1，通道4                 */
#define P2_3_DCD1             0x02                                      /* UART1数据载波检测线          */
//...   Reserved              0x03                                      /* 保留                         */
#define P2_3_FNUC             P2_3_GPIO
// P2.4
#define P2_4_GPIO             0x00                                      /* GPIO                         */
#define P2_4_PWM15            0x01                                      /* PWM-1，通道5                 */
#define P2_4_DSR1             0x02                                      /* UART1数据设置就绪线          */
//...   Reserved              0x03                                      /* 保留                         */
#define P2_4_FNUC             P2_4_GPIO
//P2.5
#define P2_5_GPIO             0x00                                      /* GPIO                         */
#define P2_5_PWM16            0x01                                      /* PWM-1，通道6                 */
#define P2_5_DTR1             0x02                                      /* UART1数据终端就绪线          */
//...   Reserved              0x03                                      /* 保留                         */
#define P2_5_FNUC             P2_5_GPIO
//P2.6
#define P2_6_GPIO             0x00                                      /* GPIO                         */
#define P2_6_PCAP10           0x01                                      /* PWM-1捕获输入，通道0         */
#define P2_6_RI1              0x02                                      /* UART1振铃输入                */
//...   Reserved              0x03                                      /* 保留                         */
#define P2_6_FNUC             P2_6_GPIO
//P2.7
#define P2_7_GPIO             0x00                                      /* GPIO                         */
#define P2_7_RD2              0x01                                      /* CAN-2接收线                  */
#define P2_7_RTS1             0x02                                      /* UART1请求发送输出            */                                                                       /* RS-485/EIA-485输出使能信号   */
//...   Reserved              0x03                                      /* 保留                         */
#define P2_7_FNUC             P2_7_GPIO
//P2.8
#define P2_8_GPIO             0x00                                      /* GPIO                         */
#define P2_8_TD2              0x01                                      /* CAN-2发送线                  */
#define P2_8_TXD2             0x02                                      /* UART2发送引脚                */
#define P2_8_ENET_MDC         0x03                                      /* 以太网MIIM时钟               */
#define P2_8_FNUC             P2_8_GPIO
//P2.9
#define P2_9_GPIO             0x00                                      /* GPIO                         */
#define P2_9_U1CONNECT        0x01                                      /* USB1软连接控制               */
#define P2_9_RXD2             0x02                                      /* UART2接收引脚                */
#define P2_9_ENET_MDIO        0x03                                      /* 以太网MIIM数据输入和输出     */
#define P2_9_FNUC             P2_9_GPIO
// P2.10（ISP）
#define P2_10_GPIO            0x00                                      /* GPIO                         */
#define P2_10_EINT0           0x01                                      /* 外部中断0输入                */
#define P2_10_NMI             0x02                                      /* 非屏蔽中断输入               */
//...   Reserved              0x03                                      /* 保留                         */                                             
#define P2_10_FNUC            P2_10_GPIO                                                 
//P2.11
#define P2_11_GPIO            0x00                                      /* GPIO                         */
#define P2_11_EINT1           0x01                                      /* 外部中断1输入                */
//...   Reserved              0x02                                      /* 保留                         */
#define P2_11_I2STX_CLK       0x03                                      /* I2S发送时钟SCK               */                                             
#define P2_11_FNUC            P2_11_GPIO                                                 
//P2.12
#define P2_12_GPIO            0x00                                      /* GPIO                         */
#define P2_12_EINT2           0x01                                      /* 外部中断2输入                */
//...   Reserved              0x02                                      /* 保留                         */
#define P2_12_I2STX_WS        0x03                                      /* I2S发送字选择WS              */                                            
#define P2_12_FNUC            P2_12_EINT2                                                 
// P2.13
#define P2_13_GPIO            0x00                                      /* GPIO                         */
#define P2_13_EINT3           0x01                                      /* 外部中断3输入                */
//...   Reserved              0x02                                      /* 保留                         */
#define P2_13_I2STX_SDA       0x03                                      /* I2S发送数据SD                */                                              
#define P2_13_FNUC            P2_13_GPIO                                            
/*********************************************************************************************************
** P3口引脚功能设置
*********************************************************************************************************/
//P3.25
#define P3_25_GPIO            0x00                                      /*  GPIO                        */
//...   Reserved              0x01                                      /*  保留                        */
#define P3_25_MAT00           0x02                                      /*  定时器0匹配输出，通道0      */
#define P3_25_PWM12           0x03                                      /*  PWM-1输出，通道2            */                                              
#define P3_25_FNUC            P3_25_GPIO                                                    
//P3.26
#define P3_26_GPIO            0x00                                      /* GPIO                         */
#define P3_26_STCLK           0x01                                      /* 系统节拍定时器时钟输入       */
#define P3_26_MAT01           0x02                                      /* 定时器0匹配输出，通道1       */
#define P3_26_PWM13           0x03                                      /* PWM-1输出，通道3             */                                              
#define P3_26_FNUC            P3_26_GPIO                                             
/*********************************************************************************************************
** P4口引脚功能设置
*********************************************************************************************************/
//P4.28
#define P4_28_GPIO            0x00                                      /* GPIO                         */
#define P4_28_RX_MCLK         0x01                                      /* —I2S接收主机时钟            */
#define P4_28_MAT20           0x02                                      /* 定时器2匹配输出，通道0       */
#define P4_28_TXD3            0x03                                      /* UART3发送引脚                */                                              
#define P4_28_FNUC            P4_28_GPIO                                                   
//P4.29
#define P4_29_GPIO            0x00                                      /* GPIO                         */
#define P4_29_TX_MCLK         0x01                                      /* I2S发送主机时钟              */
#define P4_29_MAT21           0x02                                      /* 定时器2匹配输出，通道1       */
#define P4_29_RXD3            0x03                                      /* UART3接收引脚                */                                             
#define P4_29_FNUC            P4_29_GPIO                                               
/*********************************************************************************************************
**  P10  The Trace Port Interface Unit (TPIU)
*********************************************************************************************************/
//bit[3]
#define TPIU_Disable          0x00                                     /* TPIU interface 禁止          */
#define TPIU_Enable           0x01                                     /* TPIU interface 使能          */
#define P10_3_FNUC            TPIU_Disable
/*********************************************************************************************************
** 引脚内部上下拉电阻配置
*********************************************************************************************************/
#define PIN_PULL_UP           0x00                                      /* 引脚内部上拉                 */
#define PIN_REPEATER          0x01                                      /* 引脚内部上拉                 */
#define PIN_NO_PULL           0x02                                      /* 引脚既不上拉，也不下拉       */
#define PIN_PULL_DOWN         0x03                                      /* 引脚内部下拉                 */
//P0
#define P0_0_MODE             PIN_PULL_UP
#define P0_1_MODE             PIN_PULL_UP
#define P0_2_MODE             PIN_PULL_UP
#define P0_3_MODE             PIN_PULL_UP
#define P0_4_MODE             PIN_PULL_UP
#define P0_5_MODE             PIN_PULL_UP
#define P0_6_MODE             PIN_PULL_UP
#define P0_7_MODE             PIN_PULL_UP
#define P0_8_MODE             PIN_PULL_UP
#define P0_9_MODE             PIN_PULL_UP
#define P0_10_MODE            PIN_PULL_UP
#define P0_11_MODE            PIN_PULL_UP
#define P0_12_MODE            PIN_PULL_UP
#define P0_13_MODE            PIN_PULL_UP
#define P0_14_MODE            PIN_PULL_UP
#define P0_15_MODE            PIN_PULL_UP
#define P0_16_MODE            PIN_PULL_UP
#define P0_17_MODE            PIN_PULL_UP
#define P0_18_MODE            PIN_PULL_UP
#define P0_19_MODE            PIN_PULL_UP
#define P0_20_MODE            PIN_PULL_UP
#define P0_21_MODE            PIN_PULL_UP
#define P0_22_MODE            PIN_PULL_UP
#define P0_23_MODE            PIN_PULL_UP
#define P0_24_MODE            PIN_PULL_UP
#define P0_25_MODE            PIN_PULL_UP
#define P0_26_MODE            PIN_PULL_UP
#define P0_27_MODE            PIN_PULL_UP
#define P0_28_MODE            PIN_PULL_UP
#define P0_29_MODE            PIN_PULL_UP
#define P0_30_MODE            PIN_PULL_UP
#define P0_31_MODE            PIN_PULL_UP
//P1
#define P1_0_MODE             PIN_PULL_UP
#define P1_1_MODE             PIN_PULL_UP
#define P1_2_MODE             PIN_PULL_UP
#define P1_3_MODE             PIN_PULL_UP
#define P1_4_MODE             PIN_PULL_UP
#define P1_5_MODE             PIN_PULL_UP
#define P1_6_MODE             PIN_PULL_UP
#define P1_7_MODE             PIN_PULL_UP 
#define P1_8_MODE             PIN_PULL_UP
#define P1_9_MODE             PIN_PULL_UP
#define P1_10_MODE            PIN_PULL_UP
#define P1_11_MODE            PIN_PULL_UP
#define P1_12_MODE            PIN_PULL_UP
#define P1_13_MODE            PIN_PULL_UP
#define P1_14_MODE            PIN_PULL_UP
#define P1_15_MODE            PIN_PULL_UP
#define P1_16_MODE            PIN_PULL_UP
#define P1_17_MODE            PIN_PULL_UP    
#define P1_18_MODE            PIN_PULL_UP
#define P1_19_MODE            PIN_PULL_UP
#define P1_20_MODE            PIN_PULL_UP
#define P1_21_MODE            PIN_PULL_UP
#define P1_22_MODE            PIN_PULL_UP
#define P1_23_MODE            PIN_PULL_UP
#define P1_24_MODE            PIN_PULL_UP
#define P1_25_MODE            PIN_PULL_UP
#define P1_26_MODE            PIN_PULL_UP
#define P1_27_MODE            PIN_PULL_UP     
#define P1_28_MODE            PIN_PULL_UP     
#define P1_29_MODE            PIN_PULL_UP     
#define P1_30_MODE            PIN_PULL_UP     
#define P1_31_MODE            PIN_PULL_UP     
// P2
#define P2_0_MODE             PIN_PULL_UP
#define P2_1_MODE             PIN_PULL_UP
#define P2_2_MODE             PIN_PULL_UP
#define P2_3_MODE             PIN_PULL_UP
#define P2_4_MODE             PIN_PULL_UP
#define P2_5_MODE             PIN_PULL_UP
#define P2_6_MODE             PIN_PULL_UP
#define P2_7_MODE             PIN_PULL_UP
#define P2_8_MODE             PIN_PULL_UP
#define P2_9_MODE             PIN_PULL_UP
#define P2_10_MODE            PIN_PULL_UP
#define P2_11_MODE            PIN_PULL_UP
#define P2_12_MODE            PIN_PULL_UP
#define P2_13_MODE            PIN_PULL_UP
#define P2_14_MODE            PIN_PULL_UP
#define P2_15_MODE            PIN_PULL_UP
//P3
#define P3_25_MODE            PIN_PULL_UP
#define P3_26_MODE            PIN_PULL_UP
//P4
#define P4_28_MODE            PIN_PULL_UP     
#define P4_29_MODE            PIN_PULL_UP     
		
