l20074765/EV_lpc1768_mdb_bill_coin/Firmware/LPC1700PinCfg.h
/*********************************************************************************************************
** 外设控制位在PCONP中定义
*********************************************************************************************************/
#define PCTIM0_Enable         1                                         /* 禁止定时器/计数器0功率/时钟  */
#define PCTIM0_Disable        0                                         /* 使能定时器/计数器0功率/时钟  */
#define PCTIM0_FUNC           PCTIM0_Enable

#define PCTIM1_Enable         1                                         /* 禁止定时器/计数器1功率/时钟  */
#define PCTIM1_Disable        0                                         /* 禁止定时器/计数器1功率/时钟	*/
#define PCTIM1_FUNC           PCTIM1_Enable

#define PCUART0_Enable        1                                         /* 使能UART0功率/时钟控制位     */
#define PCUART0_Disable       0                                         /* 禁止UART0功率/时钟控制位     */
#define PCUART0_FUNC          PCUART0_Enable

#define PCUART1_Enable        1                                         /* 使能UART1功率/时钟控制位	    */
#define PCUART1_Disable       0                                         /* 禁止UART1功率/时钟控制位     */
#define PCUART1_FUNC          PCUART1_Enable

#define PWM1_Enable           1                                         /* 使能PWM1功率/时钟控制位      */
#define PWM1_Disable          0                                         /* 禁止PWM1功率/时钟控制位      */
#define PWM1_FUNC             PWM1_Enable

#define PCI2C0_Enable         1                                         /* 使能I2C0接口功率/时钟控制位  */
#define PCI2C0_Disable        0                                         /* 禁止I2C0接口功率/时钟控制位  */
#define PCI2C0_FUNC           PWM1_Disable

#define PCSPI_Enable          1                                         /* 使能SPI接口功率/时钟控制位	*/
#define PCSPI_Disable         0                                         /* 禁止SPI接口功率/时钟控制位   */
#define PCSPI_FUNC            PCSPI_Enable

#define PCRTC_Enable          1                                         /* 使能RTC功率/时钟控制位       */
#define PCRTC_Disable         0                                         /* 禁止RTC功率/时钟控制位       */
#define PCRTC_FUNC            PCRTC_Disable								

#define PCSSP1_Enable         1                                         /* 使能SSP1接口功率/时钟控制位  */
#define PCSSP1_Disable        0                                         /* 禁止SSP1接口功率/时钟控制位  */
#define PCSSP1_FUNC           PCSSP1_Disable

#define PCAD_Enable           1                                         /* 使能A/D转换器功率/时钟控制位 */
#define PCAD_Disable          0                                         /* 禁止A/D转换器功率/时钟控制位 */
#define PCAD_FUNC             PCAD_Disable

#define PCCAN1_Enable         1                                         /* 使能CAN控制器1功率/时钟控制位*/
#define PCCAN1_Disable        0                                         /* 禁止CAN控制器1功率/时钟控制位*/
#define PCCAN1_FUNC           PCCAN1_Disable

#define PCCAN2_Enable         1                                         /* 使能CAN控制器2功率/时钟控制位*/
#define PCCAN2_Disable        0                                         /* 禁止CAN控制器2功率/时钟控制位*/
#define PCCAN2_FUNC           PCCAN2_Disable

#define PCGPIO_Enable         1                                         /* 使能GPIO	                    */
#define PCGPIO_Disable        0                                         /* 禁止GPIO                 	*/
#define PCGPIO_FUNC           PCGPIO_Enable

#define PCRIT_Enable          1                                         /* 使能重复中断定时器		    */
                                                                        /* 功率/时钟控制位              */
#define PCRIT_Disable         0                                         /* 禁止重复中断定时器           */
                                                                        /* 功率/时钟控制位	            */
#define PCRIT_FUNC            PCRIT_Disable

#define PCMC_Enable           1                                         /* 使能电机控制PWM              */
#define PCMC_Disable          0                                         /* 禁止电机控制PWM              */
#define PCMC_FUNC             PCMC_Disable

#define PCQEI_Enable          1                                         /* 使能正交编码器接口           */
                                                                        /* 功率/时钟控制位              */
#define PCQEI_Disable         0                                         /* 禁止正交编码器接口           */
                                                                        /* 功率/时钟控制位              */
#define PCQEI_FUNC            PCQEI_Disable

#define PCI2C1_Enable         1                                         /* 使能I2C1接口功率/时钟控制位  */
#define PCI2C1_Disable        0                                         /* 禁止I2C1接口功率/时钟控制位  */
#define PCI2C1_FUNC           PCI2C1_Enable

#define PCSSP0_Enable         1                                         /* 使能SSP0接口功率/时钟控制位  */
#define PCSSP0_Disable        0                                         /* 禁止SSP0接口功率/时钟控制位  */
#define PCSSP0_FUNC           PCSSP0_Disable

#define PCTIM2_Enable         1                                         /* 使能定时器2功率/时钟控制位   */
#define PCTIM2_Disable        0                                         /* 禁止定时器2功率/时钟控制位	*/
#define PCTIM2_FUNC           PCTIM2_Disable

#define PCTIM3_Enable         1                                         /* 使能定时器3功率/时钟控制位   */
#define PCTIM3_Disable        0                                         /* 禁止定时器3功率/时钟控制位   */
#define PCTIM3_FUNC           PCTIM2_Enable

#define PCUART2_Enable        1                                         /* 使能UART2功率/时钟控制位	    */
#define PCUART2_Disable       0                                         /* 禁止UART2功率/时钟控制位	    */
#define PCUART2_FUNC          PCUART2_Enable

#define PCUART3_Enable        1                                         /* 使能UART3功率/时钟控制位	    */
#define PCUART3_Disable       0                                         /* 禁止UART3功率/时钟控制位	    */
#define PCUART3_FUNC          PCUART3_Enable

#define PCI2C2_Enable         1                                         /* 使能I2C接口2功率/时钟控制位  */
#define PCI2C2_Disable        0                                         /* 禁止I2C接口2功率/时钟控制位	*/
#define PCI2C2_FUNC           PCI2C2_Enable

#define PCI2S_Enable          1                                         /* 使能I2S接口功率/时钟控制位   */
#define PCI2S_Disable         0                                         /* 禁止I2S接口功率/时钟控制位   */
#define PCI2S_FUNC            PCI2S_Disable

#define PCGPDMA_Enable        1                                         /* 使能GP DMA功能功率/时钟控制位*/
#define PCGPDMA_Disable       0                                         /* 禁止GP DMA功能功率/时钟控制位*/
#define PCGPDMA_FUNC          PCGPDMA_Disable

#define PCENET_Enable         1                                         /* 使能以太网模块功率/时钟控制位*/
#define PCENET_Disable        0                                         /* 禁止以太网模块功率/时钟控制位*/
#define PCENET_FUNC           PCENET_Disable

#define PCUSB_Enable          1                                         /* 使能USB接口功率/时钟控制位   */
#define PCUSB_Disable         0                                         /* 禁止USB接口功率/时钟控制位	*/
#define PCUSB_FUNC            PCUSB_Disable

/*********************************************************************************************************
** Function name:     void pinInit
** Descriptions:      初始化所有的引脚配置，完成引脚连接、上下拉电阻设置
**                    注意：需事先在 LPC1700PinCfg.h 头文件中选择好相应管脚的功能
** Input parameters:  无
** Output parameters: 无
** Returned value:    无
*********************************************************************************************************/
extern void pinInit(void);
/*********************************************************************************************************
** Function Name:     pconpInit
** Descriptions:      外设功能初始化：1 表示对应外设使能;0 表示对应外设禁止
** Input parameters:  无
** Output parameters: 无
** Returned value:    无              
*********************************************************************************************************/
extern void pconpInit(void);
#endif           
/**************************************End Of File*******************************************************/
